## Pandas

In [1]:
import pandas as pd
import numpy as np

In [22]:
df=pd.read_csv('msg_code', names=['MSG_CODE','MSG_NAME'], dtype=str)
df

   MSG_CODE       MSG_NAME
0      0100         MS승인요청
1      0110         MS승인응답
2      0300    BC통합IC승인 요청
3      0310    BC통합IC승인 응답
4      0420      MS승인취소 요청
5      0430      MS승인취소 응답
6      9300     NONBC승인 요청
7      9310     NONBC승인 응답
8      0400  BC통합IC승인취소 요청
9      0410  BC통합IC승인취소 응답
10     0200       현금서비스 요청
11     0210       현금서비스 응답

In [28]:
df.head(-1)

   MSG_CODE       MSG_NAME
0      0100         MS승인요청
1      0110         MS승인응답
2      0300    BC통합IC승인 요청
3      0310    BC통합IC승인 응답
4      0420      MS승인취소 요청
5      0430      MS승인취소 응답
6      9300     NONBC승인 요청
7      9310     NONBC승인 응답
8      0400  BC통합IC승인취소 요청
9      0410  BC통합IC승인취소 응답
10     0200       현금서비스 요청

In [29]:
df.tail(-1)

   MSG_CODE       MSG_NAME
1      0110         MS승인응답
2      0300    BC통합IC승인 요청
3      0310    BC통합IC승인 응답
4      0420      MS승인취소 요청
5      0430      MS승인취소 응답
6      9300     NONBC승인 요청
7      9310     NONBC승인 응답
8      0400  BC통합IC승인취소 요청
9      0410  BC통합IC승인취소 응답
10     0200       현금서비스 요청
11     0210       현금서비스 응답

In [46]:
df['COUNT'] = [ np.random.randint(1,45) for i in range(len(df.index))]
df.tail(6)

               MSG_NAME  COUNT
MSG_CODE
9300         NONBC승인 요청     31
9310         NONBC승인 응답     21
0400      BC통합IC승인취소 요청      8
0410      BC통합IC승인취소 응답     14
0200           현금서비스 요청      5
0210           현금서비스 응답     40

In [68]:
df = pd.DataFrame(np.arange(12).reshape(4,3), index=['r1','r2','r3','r0'], columns=['c1','c2','c3'])
df

    c1  c2  c3
r1   0   1   2
r2   3   4   5
r3   6   7   8
r0   9  10  11

In [74]:
df1 = df[df["c3"]>10]
df1

    c1  c2  c3
r0   9  10  11

In [76]:
df[['c2','c1']]

    c2  c1
r1   1   0
r2   4   3
r3   7   6
r0  10   9

In [109]:
df = pd.DataFrame(np.array([100,20000,50,500000,90,90000]).reshape(2,3),
index=['BC1','BC2'], columns=['단가','가격','비고'])
df

         단가     가격     비고
BC1     100  20000     50
BC2  500000     90  90000

In [89]:
df.loc['BC1']

단가      100
가격    20000
비고       50
Name: BC1, dtype: int32

In [94]:
df.loc[(df.단가%5==0),"단가"] = 0
df

     단가     가격     비고
BC1   0  20000     50
BC2   0     90  90000

## 내림차순 정리

     단가     가격     비고
BC1   0  20000     50
BC2   0     90  90000

In [104]:
df['ROW_SUM'] = df.sum(axis=1)
df

         단가     가격     비고  ROW_SUM
BC1     100  20000     50    20150
BC2  500000     90  90000   590090

In [110]:
df.loc['COL_SUM',:] = df.sum()
df

               단가       가격       비고
BC1         100.0  20000.0     50.0
BC2      500000.0     90.0  90000.0
COL_SUM  500100.0  20090.0  90050.0

In [119]:
beg_time = pd.to_datetime('20190621 15:20:05', format='%Y%m%d %H:%M:%S')
beg_time

Timestamp('2019-06-21 15:20:05')

In [120]:
end_time = pd.to_datetime('20190624 15:31:05', format='%Y%m%d %H:%M:%S')
end_time

Timestamp('2019-06-24 15:31:05')

In [121]:
end_time-beg_time

Timedelta('3 days 00:11:00')

In [134]:
pf = pd.DataFrame(pd.date_range('20190101','20190901',freq='MS'), columns=['DATE'])
pf

        DATE
0 2019-01-01
1 2019-02-01
2 2019-03-01
3 2019-04-01
4 2019-05-01
5 2019-06-01
6 2019-07-01
7 2019-08-01
8 2019-09-01

In [139]:
pf['DATE2'] = pd.date_range('20200101','20200901',freq='MS')
pf

        DATE      DATE2
0 2019-01-01 2020-01-01
1 2019-02-01 2020-02-01
2 2019-03-01 2020-03-01
3 2019-04-01 2020-04-01
4 2019-05-01 2020-05-01
5 2019-06-01 2020-06-01
6 2019-07-01 2020-07-01
7 2019-08-01 2020-08-01
8 2019-09-01 2020-09-01

### 현재 시점의 시간으로부터 앞으로 5분 사이의 10초당 간격 리스트 추출

In [148]:
import datetime
import pandas as pd
beg_time = datetime.datetime.now()
end_time = datetime.datetime.now() + datetime.timedelta(minutes=2.6)
print (pd.date_range(beg_time, end_time, freq='10s'))

DatetimeIndex(['2019-06-24 15:44:41.782476', '2019-06-24 15:44:51.782476',
               '2019-06-24 15:45:01.782476', '2019-06-24 15:45:11.782476',
               '2019-06-24 15:45:21.782476', '2019-06-24 15:45:31.782476',
               '2019-06-24 15:45:41.782476', '2019-06-24 15:45:51.782476',
               '2019-06-24 15:46:01.782476', '2019-06-24 15:46:11.782476',
               '2019-06-24 15:46:21.782476', '2019-06-24 15:46:31.782476',
               '2019-06-24 15:46:41.782476', '2019-06-24 15:46:51.782476',
               '2019-06-24 15:47:01.782476', '2019-06-24 15:47:11.782476'],
              dtype='datetime64[ns]', freq='10S')

In [151]:
code = {'code':['A','B','C','D','E'], 'NAME':['아','바','씨','디','아']}
code2 = {'code':['A','B','C','X','Y'], 'VALUE' :['1','2','3','4','5']}
tf = pd.DataFrame.from_dict(code)
vf = pd.DataFrame.from_dict(code2)

In [152]:
tf

  code NAME
0    A    아
1    B    바
2    C    씨
3    D    디
4    E    아

In [153]:
vf

  code VALUE
0    A     1
1    B     2
2    C     3
3    X     4
4    Y     5

In [155]:
pd.merge(tf,vf)

  code NAME VALUE
0    A    아     1
1    B    바     2
2    C    씨     3

In [163]:
rf = pd.merge(tf,vf, on=['code'], how='inner')
rf

  code NAME VALUE
0    A    아     1
1    B    바     2
2    C    씨     3

In [164]:
rf = pd.merge(tf,vf, on=['code'], how='outer')
rf

  code NAME VALUE
0    A    아     1
1    B    바     2
2    C    씨     3
3    D    디   NaN
4    E    아   NaN
5    X  NaN     4
6    Y  NaN     5

In [166]:
rf = pd.merge(tf,vf, on=['code'], how='right')
rf

  code NAME VALUE
0    A    아     1
1    B    바     2
2    C    씨     3
3    X  NaN     4
4    Y  NaN     5

In [167]:
rf = pd.merge(tf,vf, on=['code'], how='left')
rf

  code NAME VALUE
0    A    아     1
1    B    바     2
2    C    씨     3
3    D    디   NaN
4    E    아   NaN